""" Модуль views.py для приложения noteapp, который содержит функции представлений для обработки
HTTP-запросов и генерации HTTP-ответов. В данном случае, функция main() обрабатывает запросы к
главной странице приложения и возвращает отрендеренный шаблон index.html, который будет
отображаться пользователю при посещении главной страницы. Здесь мы используем функцию render()
из модуля django.shortcuts для рендеринга шаблона и передачи его в качестве HTTP-ответа. Шаблон
index.html должен находиться в директории templates/noteapp/ внутри приложения noteapp, чтобы
Django мог его найти и отобразить. Функция main() принимает объект request в качестве аргумента,
который содержит информацию о HTTP-запросе, и возвращает отрендеренный шаблон index.html в виде
HTTP-ответа. Этот код является базовым примером функции представления в Django и может быть
расширен для обработки различных типов запросов, взаимодействия с базой данных и выполнения других
задач, связанных с обработкой данных и генерацией ответов. Важно отметить, что для того, чтобы эта
функция представления работала, необходимо настроить маршрутизацию URL-адресов в файле urls.py,
чтобы указать, какой URL-адрес должен обрабатывать эту функцию представления. Например, можно
настроить URL-адрес для главной страницы приложения, чтобы он вызывал функцию main() при посещении
этого URL-адреса. Это позволит пользователям видеть отрендеренный шаблон index.html при посещении
главной страницы приложения. В целом, этот код является частью базовой структуры Django-приложения 
и служит для обработки HTTP-запросов и генерации HTTP-ответов с помощью шаблонов."""

from django.contrib.auth.decorators import login_required
from django.shortcuts import render, redirect, get_object_or_404

from .forms import TagForm, NoteForm
from .models import Tag, Note

def main(request):
    """ Оскільки головна сторінка однакова для зареєстрованого користувача і незареєстрованого, то
    ми перевіряємо це і, щоб не було помилки при виведенні шаблону, створюємо порожній список для
    notes. У користувача, що не пройшов аутентифікацію, очевидно жодних notes бути не може. """
    notes = Note.objects.filter(user=request.user).all() if request.user.is_authenticated else []
    return render(request, 'noteapp/index.html', {"notes": notes})


@login_required
def tag(request):
    """ Робота із тегами. Кожен обробник потрібно обгорнути декоратором @login_required, тому що
    тільки зареєстровані користувачі можуть працювати з нотатками. Якщо користувач не пройшов
    аутентифікацію, то при спробі отримати доступ до цього обробника його буде перенаправлено на
    сторінку входу. Якщо ж користувач пройшов аутентифікацію, то він зможе отримати доступ до цього
    обробника і працювати з тегами. У цьому обробнику ми перевіряємо, чи є запит POST, і якщо так,
    то створюємо форму на основі даних з запиту. Якщо форма є валідною, то ми створюємо новий тег,
    встановлюємо його користувача на поточного користувача і зберігаємо тег у базі даних. Після
    цього ми перенаправляємо користувача на головну сторінку. Якщо форма не є валідною, то ми
    рендеримо шаблон tag з формою, щоб користувач міг виправити помилки. Якщо ж запит не є POST,
    то ми просто рендеримо шаблон tag з порожньою формою для створення нового тегу. В результаті,
    цей обробник дозволяє користувачам створювати нові теги і зберігати їх у базі даних, а також 
    забезпечує захист від неавторизованого доступу до цієї функціональності."""
    if request.method == 'POST':
        form = TagForm(request.POST)
        if form.is_valid():
            tag = form.save(commit=False)
            tag.user = request.user
            tag.save()
            return redirect(to='noteapp:main')
        else:
            return render(request, 'noteapp/tag.html', {'form': form})

    return render(request, 'noteapp/tag.html', {'form': TagForm()})


@login_required
def note(request):
    """ Робота із нотатками. Кожен обробник потрібно обгорнути декоратором @login_required, тому що
    тільки зареєстровані користувачі можуть працювати з нотатками. Якщо користувач не пройшов
    аутентифікацію, то при спробі отримати доступ до цього обробника його буде перенаправлено на
    сторінку входу. Якщо ж користувач пройшов аутентифікацію, то він зможе отримати доступ до цього
    обробника і работать с нотатками. У цьому обробнику ми отримуємо всі теги, які належать
    поточному користувачу, і зберігаємо їх у змінну tags. """
    tags = Tag.objects.filter(user=request.user).all()

    if request.method == 'POST':
        form = NoteForm(request.POST)
        if form.is_valid():
            new_note = form.save(commit=False)
            new_note.user = request.user
            new_note.save()
            choice_tags = Tag.objects.filter(name__in=request.POST.getlist('tags'), user=request.user)
            for tag in choice_tags.iterator():
                new_note.tags.add(tag)

            return redirect(to='noteapp:main')
        else:
            return render(request, 'noteapp/note.html', {"tags": tags, 'form': form})

    return render(request, 'noteapp/note.html', {"tags": tags, 'form': NoteForm()})


@login_required
def detail(request, note_id):
    """ Робота із деталями нотатки. Кожен обробник потрібно обгорнути декоратором @login_required,
    тому що тільки зареєстровані користувачі можуть працювати з нотатками. Якщо користувач не
    пройшов аутентифікацію, то при спробі отримать доступ до цього обробника його буде
    перенаправлено на сторінку входу. Якщо ж користувач пройшов аутентифікацію, то він зможе
    отримать доступ до цього обробника і работать с деталями нотатки. У цьому обробнику ми
    використовуємо функцію get_object_or_404 для отримання об'єкта Note з бази даних на основі
    переданого note_id і поточного користувача. Якщо об'єкт Note з таким note_id і поточним
    користувачем не існує, то буде повернуто помилку 404. Якщо ж об'єкт Note існує, то ми рендеримо
    шаблон detail.html і передаємо його в контексті, щоб відобразити деталі нотатки користувачу. В
    результаті, цей обробник дозволяє користувачам переглядати деталі своїх нотаток, забезпечуючи
    захист від неавторизованого доступу до цієї функціональності."""
    note = get_object_or_404(Note, pk=note_id, user=request.user)
    return render(request, 'noteapp/detail.html', {"note": note})


@login_required
def set_done(request, note_id):
    """ Робота із встановленням статусу виконання нотатки. Кожен обробник потрібно обгорнути
    декоратором @login_required, тому що тільки зареєстровані користувачі можуть працювати з
    нотатками. Якщо користувач не пройшов аутентифікацію, то при спробі отримать доступ до цього
    обробника його буде перенаправлено на сторінку входу. Якщо ж користувач пройшов аутентифікацію,
    то він зможе отримать доступ до цього обробника і работать с встановленням статусу виконання
    нотатки. У цьому обробнику ми використовуємо метод filter для отримання об'єкта Note з бази
    даних на основі переданого note_id і поточного користувача, а потім викликаємо метод update для
    оновлення поля done цього об'єкта Note, встановлюючи його в True. Після цього ми перенаправляємо
    користувача на головну сторінку. В результаті, цей обробник дозволяє користувачам встановлювати
    статус виконання своїх нотаток, забезпечуючи захист від неавторизованого доступу до цієї
    функціональності. """
    Note.objects.filter(pk=note_id, user=request.user).update(done=True)
    return redirect(to='noteapp:main')


@login_required
def delete_note(request, note_id):
    """ Робота із видаленням нотатки. Кожен обробник потрібно обгорнути декоратором @login_required
    тому що тільки зареєстровані користувачі можуть працювати з нотатками. Якщо користувач не
    пройшов аутентифікацію, то при спробі отримать доступ до цього обробника його буде
    перенаправлено на сторінку входу. Якщо ж користувач пройшов аутентифікацію, то він зможе
    отримать доступ до цього обробника і работать з видаленням нотатки. У цьому обробнику ми
    використовуємо метод get для отримання об'єкта Note з бази даних на основі переданого note_id і
    поточного користувача, а потім викликаємо метод delete для видалення цього об'єкта. Після цього
    ми перенаправляємо користувача на головну сторінку. В результаті, цей обробник дозволяє
    користувачам видаляти свої нотатки, забезпечуючи захист від неавторизованого доступу до цієї
    функціональності. """
    Note.objects.get(pk=note_id, user=request.user).delete()
    return redirect(to='noteapp:main')
